#+TITLE: Adam's Time Log
#+AUTHOR: Adam Keenan
#+DATE: Spring 2014
#+TODO: TODO IN-PROGRESS SUBMITTED DONE
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone

* Week1

** DONE Learn Org-Mode
CLOSED: [2014-02-20 Thu 15:28]
- CLOSING NOTE [2014-02-20 Thu 15:28] \\
  Sorta got it down
   CLOCK: [2014-02-16 Sun 15:30]--[2014-02-16 Sun 17:30] =>  2:00

** DONE Nurk-Talk
CLOSED: [2014-02-20 Thu 15:27]
- CLOSING NOTE [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 14:03]--[2014-02-18 Tue 14:23] =>  0:20

** DONE Setup Virtualenv
CLOSED: [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 15:23]--[2014-02-18 Tue 15:29] =>  0:06

** DONE Install django and debug-toolbar
CLOSED: [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 15:30]--[2014-02-18 Tue 15:32] =>  0:02

** DONE Set up work environment
CLOSED: [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 15:30]--[2014-02-18 Tue 15:49] =>  0:19

** DONE Add django settings to postactivate
CLOSED: [2014-02-20 Thu 15:27]
   CLOCK: [2014-02-18 Tue 15:54]--[2014-02-18 Tue 16:03] =>  0:09

** IN-PROGRESS Read the Time-logging doc

* Week2
** DONE Fix emacs
CLOSED: [2014-02-21 Fri 16:39]
:LOGBOOK:
CLOCK: [2014-02-20 Thu 15:35]--[2014-02-20 Thu 15:41] =>  0:06
- Emacs was being silly with org
:END:
** DONE Talk about layout and UX Diagrams
CLOSED: [2014-02-21 Fri 16:40]
:LOGBOOK:
- CLOSING NOTE [2014-02-21 Fri 16:40] \\
  Me and dustin work on templates
CLOCK: [2014-02-20 Thu 14:00]--[2014-02-20 Thu 15:50] =>  1:50
:END:
** DONE Setup network share to mount
CLOSED: [2014-02-21 Fri 16:40]
:LOGBOOK:
CLOCK: [2014-02-21 Fri 16:10]--[2014-02-21 Fri 16:15] =>  0:05
- Helped Dustin with it
CLOCK: [2014-02-21 Fri 16:03]--[2014-02-21 Fri 16:10] =>  0:07
- Added to fstab
:END:
** SUBMITTED Work on the base.html
:LOGBOOK:
CLOCK: [2014-02-21 Fri 17:30]--[2014-02-21 Fri 22:07] =>  4:37
CLOCK: [2014-02-21 Fri 16:55]--[2014-02-21 Fri 17:27] =>  0:32
CLOCK: [2014-02-21 Fri 16:40]--[2014-02-21 Fri 16:43] =>  0:03
:END:
** DONE Make second base.html for choices
CLOSED: [2014-02-23 Sun 23:30]
:LOGBOOK:
CLOCK: [2014-02-23 Sun 23:04]--[2014-02-23 Sun 23:24] =>  0:20
- Added non-static version of navbar
:END:

*
* Week3
** DONE Tues Class
CLOSED: [2014-03-04 Tue 14:34]
:LOGBOOK:
CLOCK: [2014-02-25 Tue 14:00]--[2014-02-25 Tue 16:00] =>  2:00
:END:
** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-02-27 Tue 14:00]--[2014-02-27 Tue 16:00] =>  2:00
:END:

* Week4

** TODO Tues Class
:LOGBOOK:
CLOCK: [2014-03-04 Tue 12:00]--[2014-03-04 Tue 16:00] =>  2:00
- Removed detail and list templates because we don't think that they will be used.
  Installed and set up nginx to load default site. Added config for django app but haven't tested or set up really.
:END:

** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-03-06 Thu 14:00]--[2014-03-06 Thu 16:00] =>  2:00
- Made comparison detail template
- Switched to Linux Mint
:END:

* Week5

** TODO Tues Class
:LOGBOOK:
CLOCK: [2014-03-11 Thu 14:00]--[2014-03-11 Thu 16:00] =>  2:00
:END:

** TODO Thurs Class
:LOGBOOK:
CLOCK: [2014-03-13 Thu 16:00]--[2014-03-13 Thu 18:44] =>  2:44
- Made blink_to
CLOCK: [2014-03-13 Thu 14:00]--[2014-03-13 Thu 16:00] =>  2:00
- Got south working
  Added actual projects to navbar
:END:

** TODO XML Importer
:LOGBOOK:
CLOCK: [2014-03-15 Sat 02:20]--[2014-03-15 Sat 06:20] =>  4:00
- This will now import xml and output it as json.
  I wrote it as a manage.py command.
  I also added a utility function in backend.utils to assist.
:END:

* Week6
** TODO Tues Class
:LOGBOOK:
CLOCK: [2014-03-18 Tue 14:00]--[2014-03-18 Tue 16:00] =>  2:00
- Improved XML Importer
:END:

